### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-16T01:43:44.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:28",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:24" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:24/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/a458efd113e32b29ca59d32ca6035562087061a17aadb00808d6bd4710f3ab92.zip" -> "lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip"
!       s3_object_version              = "66F0BB3mdRLnqPj5lY5jmElj43KSi7BV" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "24" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "24" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "02eaf527298824426dc2552f147ce41f" -> (known after apply)
!       id                     = "lambda-builds/a458efd113e32b29ca59d32ca6035562087061a17aadb00808d6bd4710f3ab92.zip" -> (known after apply)
!       key                    = "lambda-builds/a458efd113e32b29ca59d32ca6035562087061a17aadb00808d6bd4710f3ab92.zip" -> "lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/a458efd113e32b29ca59d32ca6035562087061a17aadb00808d6bd4710f3ab92.zip" -> "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "66F0BB3mdRLnqPj5lY5jmElj43KSi7BV" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./src",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "5203079008424916494" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/a458efd113e32b29ca59d32ca6035562087061a17aadb00808d6bd4710f3ab92.zip" -> "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip"
!           "timestamp" = "1692150148118355000" -> "1692218275610109000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "8510009012986763651" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/a458efd113e32b29ca59d32ca6035562087061a17aadb00808d6bd4710f3ab92.zip" -> "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:28" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-16T01:43:27.991+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:28" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/bb797e25b0064af13359cd86e9248b4e3808176897e9836b3ed81088e4511d0c.zip" -> "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.zip"
!       s3_object_version           = "8MtjgEBhKNXQWavmf_mFlr9waEdBt19h" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "Krq1LtcXMZdePkj35q7MwAlxa2H08g4QYW49MtRXdBo=" -> (known after apply)
!       source_code_size            = 29719243 -> (known after apply)
!       version                     = "28" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "5635f19ffebf0798ddcf9a5010596489-6" -> (known after apply)
!       id                     = "builds/bb797e25b0064af13359cd86e9248b4e3808176897e9836b3ed81088e4511d0c.zip" -> (known after apply)
!       key                    = "builds/bb797e25b0064af13359cd86e9248b4e3808176897e9836b3ed81088e4511d0c.zip" -> "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/bb797e25b0064af13359cd86e9248b4e3808176897e9836b3ed81088e4511d0c.zip" -> "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "8MtjgEBhKNXQWavmf_mFlr9waEdBt19h" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "21832575195023447" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/bb797e25b0064af13359cd86e9248b4e3808176897e9836b3ed81088e4511d0c.zip" -> "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.zip"
!           "timestamp" = "1692150150027141000" -> "1692218277490635000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "1449450018953816614" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/bb797e25b0064af13359cd86e9248b4e3808176897e9836b3ed81088e4511d0c.zip" -> "builds/bd5c9877decef1c52b5153da835ffc7494fcbce58564672ad5fad841d4a0e8d1.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>